MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2GK8JHAGV20000/mcu.h
        __IO  uint8_t RESERVED1[24];
    union {
        __IO uint32_t RGSR;
        stc_ethernet_mac_rgsr_field_t RGSR_f;
        struct {
          union {
            __IO uint16_t RGSRL;
            struct {
              __IO uint8_t RGSRLL;
              __IO uint8_t RGSRLH;
            };
          };
          union {
            __IO uint16_t RGSRH;
            struct {
              __IO uint8_t RGSRHL;
              __IO uint8_t RGSRHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED2[36];
    union {
        __IO uint32_t MMC_CNTL;
        stc_ethernet_mac_mmc_cntl_field_t MMC_CNTL_f;
        struct {
          union {
            __IO uint16_t MMC_CNTLL;
            struct {
              __IO uint8_t MMC_CNTLLL;
              __IO uint8_t MMC_CNTLLH;
            };
          };
          union {
            __IO uint16_t MMC_CNTLH;
            struct {
              __IO uint8_t MMC_CNTLHL;
              __IO uint8_t MMC_CNTLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MMC_INTR_RX;
        stc_ethernet_mac_mmc_intr_rx_field_t MMC_INTR_RX_f;
        struct {
          union {
            __IO uint16_t MMC_INTR_RXL;
            struct {
              __IO uint8_t MMC_INTR_RXLL;
              __IO uint8_t MMC_INTR_RXLH;
            };
          };
          union {
            __IO uint16_t MMC_INTR_RXH;
            struct {
              __IO uint8_t MMC_INTR_RXHL;
              __IO uint8_t MMC_INTR_RXHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MMC_INTR_TX;
        stc_ethernet_mac_mmc_intr_tx_field_t MMC_INTR_TX_f;
        struct {
          union {
            __IO uint16_t MMC_INTR_TXL;
            struct {
              __IO uint8_t MMC_INTR_TXLL;
              __IO uint8_t MMC_INTR_TXLH;
            };
          };
          union {
            __IO uint16_t MMC_INTR_TXH;
            struct {
              __IO uint8_t MMC_INTR_TXHL;
              __IO uint8_t MMC_INTR_TXHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MMC_INTR_MASK_RX;
        stc_ethernet_mac_mmc_intr_mask_rx_field_t MMC_INTR_MASK_RX_f;
        struct {
          union {
            __IO uint16_t MMC_INTR_MASK_RXL;
            struct {
              __IO uint8_t MMC_INTR_MASK_RXLL;
              __IO uint8_t MMC_INTR_MASK_RXLH;
            };
          };
          union {
            __IO uint16_t MMC_INTR_MASK_RXH;
            struct {
              __IO uint8_t MMC_INTR_MASK_RXHL;
              __IO uint8_t MMC_INTR_MASK_RXHH;
            };
          };
        };
    };
    union {
        __IO uint32_t MMC_INTR_MASK_TX;
        stc_ethernet_mac_mmc_intr_mask_tx_field_t MMC_INTR_MASK_TX_f;
        struct {
          union {
            __IO uint16_t MMC_INTR_MASK_TXL;
            struct {
              __IO uint8_t MMC_INTR_MASK_TXLL;
              __IO uint8_t MMC_INTR_MASK_TXLH;
            };
          };
          union {
            __IO uint16_t MMC_INTR_MASK_TXH;
            struct {
              __IO uint8_t MMC_INTR_MASK_TXHL;
              __IO uint8_t MMC_INTR_MASK_TXHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXOCTETCOUNT_GB;
        struct {
          union {
            __IO uint16_t TXOCTETCOUNT_GBL;
            struct {
              __IO uint8_t TXOCTETCOUNT_GBLL;
              __IO uint8_t TXOCTETCOUNT_GBLH;
            };
          };
          union {
            __IO uint16_t TXOCTETCOUNT_GBH;
            struct {
              __IO uint8_t TXOCTETCOUNT_GBHL;
              __IO uint8_t TXOCTETCOUNT_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFRAMECOUNT_GB;
        struct {
          union {
            __IO uint16_t TXFRAMECOUNT_GBL;
            struct {
              __IO uint8_t TXFRAMECOUNT_GBLL;
              __IO uint8_t TXFRAMECOUNT_GBLH;
            };
          };
          union {
            __IO uint16_t TXFRAMECOUNT_GBH;
            struct {
              __IO uint8_t TXFRAMECOUNT_GBHL;
              __IO uint8_t TXFRAMECOUNT_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXBROADCASTFRAMES_G;
        struct {
          union {
            __IO uint16_t TXBROADCASTFRAMES_GL;
            struct {
              __IO uint8_t TXBROADCASTFRAMES_GLL;
              __IO uint8_t TXBROADCASTFRAMES_GLH;
            };
          };
          union {
            __IO uint16_t TXBROADCASTFRAMES_GH;
            struct {
              __IO uint8_t TXBROADCASTFRAMES_GHL;
              __IO uint8_t TXBROADCASTFRAMES_GHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXMULTICASTFRAMES_G;
        struct {
          union {
            __IO uint16_t TXMULTICASTFRAMES_GL;
            struct {
              __IO uint8_t TXMULTICASTFRAMES_GLL;
              __IO uint8_t TXMULTICASTFRAMES_GLH;
            };
          };
          union {
            __IO uint16_t TXMULTICASTFRAMES_GH;
            struct {
              __IO uint8_t TXMULTICASTFRAMES_GHL;
              __IO uint8_t TXMULTICASTFRAMES_GHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TX64OCTETS_GB;
        struct {
          union {
            __IO uint16_t TX64OCTETS_GBL;
            struct {
              __IO uint8_t TX64OCTETS_GBLL;
              __IO uint8_t TX64OCTETS_GBLH;
            };
          };
          union {
            __IO uint16_t TX64OCTETS_GBH;
            struct {
              __IO uint8_t TX64OCTETS_GBHL;
              __IO uint8_t TX64OCTETS_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TX65TO127OCTETS_GB;
        struct {
          union {
            __IO uint16_t TX65TO127OCTETS_GBL;
            struct {
              __IO uint8_t TX65TO127OCTETS_GBLL;
              __IO uint8_t TX65TO127OCTETS_GBLH;
            };
          };
          union {
            __IO uint16_t TX65TO127OCTETS_GBH;
            struct {
              __IO uint8_t TX65TO127OCTETS_GBHL;
              __IO uint8_t TX65TO127OCTETS_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TX128TO255OCTETS_GB;
        struct {
          union {
            __IO uint16_t TX128TO255OCTETS_GBL;
            struct {
              __IO uint8_t TX128TO255OCTETS_GBLL;
              __IO uint8_t TX128TO255OCTETS_GBLH;
            };
          };
          union {
            __IO uint16_t TX128TO255OCTETS_GBH;
            struct {
              __IO uint8_t TX128TO255OCTETS_GBHL;
              __IO uint8_t TX128TO255OCTETS_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TX256TO511OCTETS_GB;
        struct {
          union {
            __IO uint16_t TX256TO511OCTETS_GBL;
            struct {
              __IO uint8_t TX256TO511OCTETS_GBLL;
              __IO uint8_t TX256TO511OCTETS_GBLH;
            };
          };
          union {
            __IO uint16_t TX256TO511OCTETS_GBH;
            struct {
              __IO uint8_t TX256TO511OCTETS_GBHL;
              __IO uint8_t TX256TO511OCTETS_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TX512TO1023OCTETS_GB;
        struct {
          union {
            __IO uint16_t TX512TO1023OCTETS_GBL;
            struct {
              __IO uint8_t TX512TO1023OCTETS_GBLL;
              __IO uint8_t TX512TO1023OCTETS_GBLH;
            };
          };
          union {
            __IO uint16_t TX512TO1023OCTETS_GBH;
            struct {
              __IO uint8_t TX512TO1023OCTETS_GBHL;
              __IO uint8_t TX512TO1023OCTETS_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TX1024TOMAXOCTETS_GB;
        struct {
          union {
            __IO uint16_t TX1024TOMAXOCTETS_GBL;
            struct {
              __IO uint8_t TX1024TOMAXOCTETS_GBLL;
              __IO uint8_t TX1024TOMAXOCTETS_GBLH;
            };
          };
          union {
            __IO uint16_t TX1024TOMAXOCTETS_GBH;
            struct {
              __IO uint8_t TX1024TOMAXOCTETS_GBHL;
              __IO uint8_t TX1024TOMAXOCTETS_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXUNICASTFRAMES_GB;
        struct {
          union {
            __IO uint16_t TXUNICASTFRAMES_GBL;
            struct {
              __IO uint8_t TXUNICASTFRAMES_GBLL;
              __IO uint8_t TXUNICASTFRAMES_GBLH;
            };
          };
          union {
            __IO uint16_t TXUNICASTFRAMES_GBH;
            struct {
              __IO uint8_t TXUNICASTFRAMES_GBHL;
              __IO uint8_t TXUNICASTFRAMES_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXMULTICASTFRAMES_GB;
        struct {
          union {
            __IO uint16_t TXMULTICASTFRAMES_GBL;
            struct {
              __IO uint8_t TXMULTICASTFRAMES_GBLL;
              __IO uint8_t TXMULTICASTFRAMES_GBLH;
            };
          };
          union {
            __IO uint16_t TXMULTICASTFRAMES_GBH;
            struct {
              __IO uint8_t TXMULTICASTFRAMES_GBHL;
              __IO uint8_t TXMULTICASTFRAMES_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXBROADCASTFRAMES_GB;
        struct {
          union {
            __IO uint16_t TXBROADCASTFRAMES_GBL;
            struct {
              __IO uint8_t TXBROADCASTFRAMES_GBLL;
              __IO uint8_t TXBROADCASTFRAMES_GBLH;
            };
          };
          union {
            __IO uint16_t TXBROADCASTFRAMES_GBH;
            struct {
              __IO uint8_t TXBROADCASTFRAMES_GBHL;
              __IO uint8_t TXBROADCASTFRAMES_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXUNDERFLOWERROR;
        struct {
          union {
            __IO uint16_t TXUNDERFLOWERRORL;
            struct {
              __IO uint8_t TXUNDERFLOWERRORLL;
              __IO uint8_t TXUNDERFLOWERRORLH;
            };
          };
          union {
            __IO uint16_t TXUNDERFLOWERRORH;
            struct {
              __IO uint8_t TXUNDERFLOWERRORHL;
              __IO uint8_t TXUNDERFLOWERRORHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXSINGLECOL_G;
        struct {
          union {
            __IO uint16_t TXSINGLECOL_GL;
            struct {
              __IO uint8_t TXSINGLECOL_GLL;
              __IO uint8_t TXSINGLECOL_GLH;
            };
          };
          union {
            __IO uint16_t TXSINGLECOL_GH;
            struct {
              __IO uint8_t TXSINGLECOL_GHL;
              __IO uint8_t TXSINGLECOL_GHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXMULTICOL_G;
        struct {
          union {
            __IO uint16_t TXMULTICOL_GL;
            struct {
              __IO uint8_t TXMULTICOL_GLL;
              __IO uint8_t TXMULTICOL_GLH;
            };
          };
          union {
            __IO uint16_t TXMULTICOL_GH;
            struct {
              __IO uint8_t TXMULTICOL_GHL;
              __IO uint8_t TXMULTICOL_GHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXDEFERRED;
        struct {
          union {
            __IO uint16_t TXDEFERREDL;
            struct {
              __IO uint8_t TXDEFERREDLL;
              __IO uint8_t TXDEFERREDLH;
            };
          };
          union {
            __IO uint16_t TXDEFERREDH;
            struct {
              __IO uint8_t TXDEFERREDHL;
              __IO uint8_t TXDEFERREDHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXLATECOL;
        struct {
          union {
            __IO uint16_t TXLATECOLL;
            struct {
              __IO uint8_t TXLATECOLLL;
              __IO uint8_t TXLATECOLLH;
            };
          };
          union {
            __IO uint16_t TXLATECOLH;
            struct {
              __IO uint8_t TXLATECOLHL;
              __IO uint8_t TXLATECOLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXEXESSCOL;
        struct {
          union {
            __IO uint16_t TXEXESSCOLL;
            struct {
              __IO uint8_t TXEXESSCOLLL;
              __IO uint8_t TXEXESSCOLLH;
            };
          };
          union {
            __IO uint16_t TXEXESSCOLH;
            struct {
              __IO uint8_t TXEXESSCOLHL;
              __IO uint8_t TXEXESSCOLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXCARRIERERROR;
        struct {
          union {
            __IO uint16_t TXCARRIERERRORL;
            struct {
              __IO uint8_t TXCARRIERERRORLL;
              __IO uint8_t TXCARRIERERRORLH;
            };
          };
          union {
            __IO uint16_t TXCARRIERERRORH;
            struct {
              __IO uint8_t TXCARRIERERRORHL;
              __IO uint8_t TXCARRIERERRORHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXOCTETCOUNT_G;
        struct {
          union {
            __IO uint16_t TXOCTETCOUNT_GL;
            struct {
              __IO uint8_t TXOCTETCOUNT_GLL;
              __IO uint8_t TXOCTETCOUNT_GLH;
            };
          };
          union {
            __IO uint16_t TXOCTETCOUNT_GH;
            struct {
              __IO uint8_t TXOCTETCOUNT_GHL;
              __IO uint8_t TXOCTETCOUNT_GHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFRAMECOUNT_G;
        struct {
          union {
            __IO uint16_t TXFRAMECOUNT_GL;
            struct {
              __IO uint8_t TXFRAMECOUNT_GLL;
              __IO uint8_t TXFRAMECOUNT_GLH;
            };
          };
          union {
            __IO uint16_t TXFRAMECOUNT_GH;
            struct {
              __IO uint8_t TXFRAMECOUNT_GHL;
              __IO uint8_t TXFRAMECOUNT_GHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXEXECESSDEF_G;
        struct {
          union {
            __IO uint16_t TXEXECESSDEF_GL;
            struct {
              __IO uint8_t TXEXECESSDEF_GLL;
              __IO uint8_t TXEXECESSDEF_GLH;
            };
          };
          union {
            __IO uint16_t TXEXECESSDEF_GH;
            struct {
              __IO uint8_t TXEXECESSDEF_GHL;
              __IO uint8_t TXEXECESSDEF_GHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXPAUSEFRAMES;
        struct {
          union {
            __IO uint16_t TXPAUSEFRAMESL;
            struct {
              __IO uint8_t TXPAUSEFRAMESLL;
              __IO uint8_t TXPAUSEFRAMESLH;
            };
          };
          union {
            __IO uint16_t TXPAUSEFRAMESH;
            struct {
              __IO uint8_t TXPAUSEFRAMESHL;
              __IO uint8_t TXPAUSEFRAMESHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXVLANFRAMES_G;
        struct {
          union {
            __IO uint16_t TXVLANFRAMES_GL;
            struct {
              __IO uint8_t TXVLANFRAMES_GLL;
              __IO uint8_t TXVLANFRAMES_GLH;
            };
          };
          union {
            __IO uint16_t TXVLANFRAMES_GH;
            struct {
              __IO uint8_t TXVLANFRAMES_GHL;
              __IO uint8_t TXVLANFRAMES_GHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED3[8];
    union {
        __IO uint32_t RXFRAMECOUNT_GB;
        struct {
          union {
            __IO uint16_t RXFRAMECOUNT_GBL;
            struct {
              __IO uint8_t RXFRAMECOUNT_GBLL;
              __IO uint8_t RXFRAMECOUNT_GBLH;
            };
          };
          union {
            __IO uint16_t RXFRAMECOUNT_GBH;
            struct {
              __IO uint8_t RXFRAMECOUNT_GBHL;
              __IO uint8_t RXFRAMECOUNT_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXOCTETCOUNT_GB;
        struct {
          union {
            __IO uint16_t RXOCTETCOUNT_GBL;
            struct {
              __IO uint8_t RXOCTETCOUNT_GBLL;
              __IO uint8_t RXOCTETCOUNT_GBLH;
            };
          };
          union {
            __IO uint16_t RXOCTETCOUNT_GBH;
            struct {
              __IO uint8_t RXOCTETCOUNT_GBHL;
              __IO uint8_t RXOCTETCOUNT_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXOCTETCOUNT_G;
        struct {
          union {
            __IO uint16_t RXOCTETCOUNT_GL;
            struct {
              __IO uint8_t RXOCTETCOUNT_GLL;
              __IO uint8_t RXOCTETCOUNT_GLH;
            };
          };
          union {
            __IO uint16_t RXOCTETCOUNT_GH;
            struct {
              __IO uint8_t RXOCTETCOUNT_GHL;
              __IO uint8_t RXOCTETCOUNT_GHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXBROADCASTFRAMES_G;
        struct {
          union {
            __IO uint16_t RXBROADCASTFRAMES_GL;
            struct {
              __IO uint8_t RXBROADCASTFRAMES_GLL;
              __IO uint8_t RXBROADCASTFRAMES_GLH;
            };
          };
          union {
            __IO uint16_t RXBROADCASTFRAMES_GH;
            struct {
              __IO uint8_t RXBROADCASTFRAMES_GHL;
              __IO uint8_t RXBROADCASTFRAMES_GHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXMULTICASTFRAMES_G;
        struct {
          union {
            __IO uint16_t RXMULTICASTFRAMES_GL;
            struct {
              __IO uint8_t RXMULTICASTFRAMES_GLL;
              __IO uint8_t RXMULTICASTFRAMES_GLH;
            };
          };
          union {
            __IO uint16_t RXMULTICASTFRAMES_GH;
            struct {
              __IO uint8_t RXMULTICASTFRAMES_GHL;
              __IO uint8_t RXMULTICASTFRAMES_GHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXCRCERROR;
        struct {
          union {
            __IO uint16_t RXCRCERRORL;
            struct {
              __IO uint8_t RXCRCERRORLL;
              __IO uint8_t RXCRCERRORLH;
            };
          };
          union {
            __IO uint16_t RXCRCERRORH;
            struct {
              __IO uint8_t RXCRCERRORHL;
              __IO uint8_t RXCRCERRORHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXALLIGNMENTERROR;
        struct {
          union {
            __IO uint16_t RXALLIGNMENTERRORL;
            struct {
              __IO uint8_t RXALLIGNMENTERRORLL;
              __IO uint8_t RXALLIGNMENTERRORLH;
            };
          };
          union {
            __IO uint16_t RXALLIGNMENTERRORH;
            struct {
              __IO uint8_t RXALLIGNMENTERRORHL;
              __IO uint8_t RXALLIGNMENTERRORHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXRUNTERROR;
        struct {
          union {
            __IO uint16_t RXRUNTERRORL;
            struct {
              __IO uint8_t RXRUNTERRORLL;
              __IO uint8_t RXRUNTERRORLH;
            };
          };
          union {
            __IO uint16_t RXRUNTERRORH;
            struct {
              __IO uint8_t RXRUNTERRORHL;
              __IO uint8_t RXRUNTERRORHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXJABBERERROR;
        struct {
          union {
            __IO uint16_t RXJABBERERRORL;
            struct {
              __IO uint8_t RXJABBERERRORLL;
              __IO uint8_t RXJABBERERRORLH;
            };
          };
          union {
            __IO uint16_t RXJABBERERRORH;
            struct {
              __IO uint8_t RXJABBERERRORHL;
              __IO uint8_t RXJABBERERRORHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXUNDERSIZE_G;
        struct {
          union {
            __IO uint16_t RXUNDERSIZE_GL;
            struct {
              __IO uint8_t RXUNDERSIZE_GLL;
              __IO uint8_t RXUNDERSIZE_GLH;
            };
          };
          union {
            __IO uint16_t RXUNDERSIZE_GH;
            struct {
              __IO uint8_t RXUNDERSIZE_GHL;
              __IO uint8_t RXUNDERSIZE_GHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXOVERSIZE_G;
        struct {
          union {
            __IO uint16_t RXOVERSIZE_GL;
            struct {
              __IO uint8_t RXOVERSIZE_GLL;
              __IO uint8_t RXOVERSIZE_GLH;
            };
          };
          union {
            __IO uint16_t RXOVERSIZE_GH;
            struct {
              __IO uint8_t RXOVERSIZE_GHL;
              __IO uint8_t RXOVERSIZE_GHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RX64OCTETS_GB;
        struct {
          union {
            __IO uint16_t RX64OCTETS_GBL;
            struct {
              __IO uint8_t RX64OCTETS_GBLL;
              __IO uint8_t RX64OCTETS_GBLH;
            };
          };
          union {
            __IO uint16_t RX64OCTETS_GBH;
            struct {
              __IO uint8_t RX64OCTETS_GBHL;
              __IO uint8_t RX64OCTETS_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RX65TO127OCTETS_GB;
        struct {
          union {
            __IO uint16_t RX65TO127OCTETS_GBL;
            struct {
              __IO uint8_t RX65TO127OCTETS_GBLL;
              __IO uint8_t RX65TO127OCTETS_GBLH;
            };
          };
          union {
            __IO uint16_t RX65TO127OCTETS_GBH;
            struct {
              __IO uint8_t RX65TO127OCTETS_GBHL;
              __IO uint8_t RX65TO127OCTETS_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RX128TO255OCTETS_GB;
        struct {
          union {
            __IO uint16_t RX128TO255OCTETS_GBL;
            struct {
              __IO uint8_t RX128TO255OCTETS_GBLL;
              __IO uint8_t RX128TO255OCTETS_GBLH;
            };
          };
          union {
            __IO uint16_t RX128TO255OCTETS_GBH;
            struct {
              __IO uint8_t RX128TO255OCTETS_GBHL;
              __IO uint8_t RX128TO255OCTETS_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RX256TO511OCTETS_GB;
        struct {
          union {
            __IO uint16_t RX256TO511OCTETS_GBL;
            struct {
              __IO uint8_t RX256TO511OCTETS_GBLL;
              __IO uint8_t RX256TO511OCTETS_GBLH;
            };
          };
          union {
            __IO uint16_t RX256TO511OCTETS_GBH;
            struct {
              __IO uint8_t RX256TO511OCTETS_GBHL;
              __IO uint8_t RX256TO511OCTETS_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RX512TO1023OCTETS_GB;
        struct {
          union {
            __IO uint16_t RX512TO1023OCTETS_GBL;
            struct {
              __IO uint8_t RX512TO1023OCTETS_GBLL;
              __IO uint8_t RX512TO1023OCTETS_GBLH;
            };
          };
          union {
            __IO uint16_t RX512TO1023OCTETS_GBH;
            struct {
              __IO uint8_t RX512TO1023OCTETS_GBHL;
              __IO uint8_t RX512TO1023OCTETS_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RX1024TOMAXOCTETS_GB;
        struct {
          union {
            __IO uint16_t RX1024TOMAXOCTETS_GBL;
            struct {
              __IO uint8_t RX1024TOMAXOCTETS_GBLL;
              __IO uint8_t RX1024TOMAXOCTETS_GBLH;
            };
          };
          union {
            __IO uint16_t RX1024TOMAXOCTETS_GBH;
            struct {
              __IO uint8_t RX1024TOMAXOCTETS_GBHL;
