MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2GK8JHAGV20000/mcu.h
#define bFM_GPIO_PDOR3_P2                         *((volatile  uint8_t *)(0x42DE8188UL))
#define bFM4_GPIO_PDOR3_P2                        *((volatile  uint8_t *)(0x42DE8188UL))
#define bFM_GPIO_PDOR3_P3                         *((volatile  uint8_t *)(0x42DE818CUL))
#define bFM4_GPIO_PDOR3_P3                        *((volatile  uint8_t *)(0x42DE818CUL))
#define bFM_GPIO_PDOR3_P4                         *((volatile  uint8_t *)(0x42DE8190UL))
#define bFM4_GPIO_PDOR3_P4                        *((volatile  uint8_t *)(0x42DE8190UL))
#define bFM_GPIO_PDOR3_P5                         *((volatile  uint8_t *)(0x42DE8194UL))
#define bFM4_GPIO_PDOR3_P5                        *((volatile  uint8_t *)(0x42DE8194UL))
#define bFM_GPIO_PDOR3_P6                         *((volatile  uint8_t *)(0x42DE8198UL))
#define bFM4_GPIO_PDOR3_P6                        *((volatile  uint8_t *)(0x42DE8198UL))
#define bFM_GPIO_PDOR3_P7                         *((volatile  uint8_t *)(0x42DE819CUL))
#define bFM4_GPIO_PDOR3_P7                        *((volatile  uint8_t *)(0x42DE819CUL))
#define bFM_GPIO_PDOR3_P8                         *((volatile  uint8_t *)(0x42DE81A0UL))
#define bFM4_GPIO_PDOR3_P8                        *((volatile  uint8_t *)(0x42DE81A0UL))
#define bFM_GPIO_PDOR3_P9                         *((volatile  uint8_t *)(0x42DE81A4UL))
#define bFM4_GPIO_PDOR3_P9                        *((volatile  uint8_t *)(0x42DE81A4UL))
#define bFM_GPIO_PDOR3_PA                         *((volatile  uint8_t *)(0x42DE81A8UL))
#define bFM4_GPIO_PDOR3_PA                        *((volatile  uint8_t *)(0x42DE81A8UL))
#define bFM_GPIO_PDOR3_PB                         *((volatile  uint8_t *)(0x42DE81ACUL))
#define bFM4_GPIO_PDOR3_PB                        *((volatile  uint8_t *)(0x42DE81ACUL))
#define bFM_GPIO_PDOR3_PC                         *((volatile  uint8_t *)(0x42DE81B0UL))
#define bFM4_GPIO_PDOR3_PC                        *((volatile  uint8_t *)(0x42DE81B0UL))
#define bFM_GPIO_PDOR3_PD                         *((volatile  uint8_t *)(0x42DE81B4UL))
#define bFM4_GPIO_PDOR3_PD                        *((volatile  uint8_t *)(0x42DE81B4UL))
#define bFM_GPIO_PDOR3_PE                         *((volatile  uint8_t *)(0x42DE81B8UL))
#define bFM4_GPIO_PDOR3_PE                        *((volatile  uint8_t *)(0x42DE81B8UL))

#define bFM_GPIO_PDOR4_P0                         *((volatile  uint8_t *)(0x42DE8200UL))
#define bFM4_GPIO_PDOR4_P0                        *((volatile  uint8_t *)(0x42DE8200UL))
#define bFM_GPIO_PDOR4_P1                         *((volatile  uint8_t *)(0x42DE8204UL))
#define bFM4_GPIO_PDOR4_P1                        *((volatile  uint8_t *)(0x42DE8204UL))
#define bFM_GPIO_PDOR4_P2                         *((volatile  uint8_t *)(0x42DE8208UL))
#define bFM4_GPIO_PDOR4_P2                        *((volatile  uint8_t *)(0x42DE8208UL))
#define bFM_GPIO_PDOR4_P3                         *((volatile  uint8_t *)(0x42DE820CUL))
#define bFM4_GPIO_PDOR4_P3                        *((volatile  uint8_t *)(0x42DE820CUL))
#define bFM_GPIO_PDOR4_P4                         *((volatile  uint8_t *)(0x42DE8210UL))
#define bFM4_GPIO_PDOR4_P4                        *((volatile  uint8_t *)(0x42DE8210UL))
#define bFM_GPIO_PDOR4_P5                         *((volatile  uint8_t *)(0x42DE8214UL))
#define bFM4_GPIO_PDOR4_P5                        *((volatile  uint8_t *)(0x42DE8214UL))
#define bFM_GPIO_PDOR4_P6                         *((volatile  uint8_t *)(0x42DE8218UL))
#define bFM4_GPIO_PDOR4_P6                        *((volatile  uint8_t *)(0x42DE8218UL))
#define bFM_GPIO_PDOR4_P7                         *((volatile  uint8_t *)(0x42DE821CUL))
#define bFM4_GPIO_PDOR4_P7                        *((volatile  uint8_t *)(0x42DE821CUL))
#define bFM_GPIO_PDOR4_P8                         *((volatile  uint8_t *)(0x42DE8220UL))
#define bFM4_GPIO_PDOR4_P8                        *((volatile  uint8_t *)(0x42DE8220UL))
#define bFM_GPIO_PDOR4_P9                         *((volatile  uint8_t *)(0x42DE8224UL))
#define bFM4_GPIO_PDOR4_P9                        *((volatile  uint8_t *)(0x42DE8224UL))
#define bFM_GPIO_PDOR4_PA                         *((volatile  uint8_t *)(0x42DE8228UL))
#define bFM4_GPIO_PDOR4_PA                        *((volatile  uint8_t *)(0x42DE8228UL))
#define bFM_GPIO_PDOR4_PB                         *((volatile  uint8_t *)(0x42DE822CUL))
#define bFM4_GPIO_PDOR4_PB                        *((volatile  uint8_t *)(0x42DE822CUL))
#define bFM_GPIO_PDOR4_PC                         *((volatile  uint8_t *)(0x42DE8230UL))
#define bFM4_GPIO_PDOR4_PC                        *((volatile  uint8_t *)(0x42DE8230UL))
#define bFM_GPIO_PDOR4_PD                         *((volatile  uint8_t *)(0x42DE8234UL))
#define bFM4_GPIO_PDOR4_PD                        *((volatile  uint8_t *)(0x42DE8234UL))
#define bFM_GPIO_PDOR4_PE                         *((volatile  uint8_t *)(0x42DE8238UL))
#define bFM4_GPIO_PDOR4_PE                        *((volatile  uint8_t *)(0x42DE8238UL))

#define bFM_GPIO_PDOR6_P0                         *((volatile  uint8_t *)(0x42DE8300UL))
#define bFM4_GPIO_PDOR6_P0                        *((volatile  uint8_t *)(0x42DE8300UL))
#define bFM_GPIO_PDOR6_P1                         *((volatile  uint8_t *)(0x42DE8304UL))
#define bFM4_GPIO_PDOR6_P1                        *((volatile  uint8_t *)(0x42DE8304UL))
#define bFM_GPIO_PDOR6_P2                         *((volatile  uint8_t *)(0x42DE8308UL))
#define bFM4_GPIO_PDOR6_P2                        *((volatile  uint8_t *)(0x42DE8308UL))
#define bFM_GPIO_PDOR6_P3                         *((volatile  uint8_t *)(0x42DE830CUL))
#define bFM4_GPIO_PDOR6_P3                        *((volatile  uint8_t *)(0x42DE830CUL))
#define bFM_GPIO_PDOR6_PE                         *((volatile  uint8_t *)(0x42DE8338UL))
#define bFM4_GPIO_PDOR6_PE                        *((volatile  uint8_t *)(0x42DE8338UL))

#define bFM_GPIO_PDOR7_P0                         *((volatile  uint8_t *)(0x42DE8380UL))
#define bFM4_GPIO_PDOR7_P0                        *((volatile  uint8_t *)(0x42DE8380UL))
#define bFM_GPIO_PDOR7_P1                         *((volatile  uint8_t *)(0x42DE8384UL))
#define bFM4_GPIO_PDOR7_P1                        *((volatile  uint8_t *)(0x42DE8384UL))
#define bFM_GPIO_PDOR7_P2                         *((volatile  uint8_t *)(0x42DE8388UL))
#define bFM4_GPIO_PDOR7_P2                        *((volatile  uint8_t *)(0x42DE8388UL))
#define bFM_GPIO_PDOR7_P3                         *((volatile  uint8_t *)(0x42DE838CUL))
#define bFM4_GPIO_PDOR7_P3                        *((volatile  uint8_t *)(0x42DE838CUL))
#define bFM_GPIO_PDOR7_P4                         *((volatile  uint8_t *)(0x42DE8390UL))
#define bFM4_GPIO_PDOR7_P4                        *((volatile  uint8_t *)(0x42DE8390UL))
#define bFM_GPIO_PDOR7_P5                         *((volatile  uint8_t *)(0x42DE8394UL))
#define bFM4_GPIO_PDOR7_P5                        *((volatile  uint8_t *)(0x42DE8394UL))
#define bFM_GPIO_PDOR7_P6                         *((volatile  uint8_t *)(0x42DE8398UL))
#define bFM4_GPIO_PDOR7_P6                        *((volatile  uint8_t *)(0x42DE8398UL))
#define bFM_GPIO_PDOR7_P7                         *((volatile  uint8_t *)(0x42DE839CUL))
#define bFM4_GPIO_PDOR7_P7                        *((volatile  uint8_t *)(0x42DE839CUL))
#define bFM_GPIO_PDOR7_P8                         *((volatile  uint8_t *)(0x42DE83A0UL))
#define bFM4_GPIO_PDOR7_P8                        *((volatile  uint8_t *)(0x42DE83A0UL))
#define bFM_GPIO_PDOR7_P9                         *((volatile  uint8_t *)(0x42DE83A4UL))
#define bFM4_GPIO_PDOR7_P9                        *((volatile  uint8_t *)(0x42DE83A4UL))
#define bFM_GPIO_PDOR7_PA                         *((volatile  uint8_t *)(0x42DE83A8UL))
#define bFM4_GPIO_PDOR7_PA                        *((volatile  uint8_t *)(0x42DE83A8UL))

#define bFM_GPIO_PDOR8_P0                         *((volatile  uint8_t *)(0x42DE8400UL))
#define bFM4_GPIO_PDOR8_P0                        *((volatile  uint8_t *)(0x42DE8400UL))
#define bFM_GPIO_PDOR8_P1                         *((volatile  uint8_t *)(0x42DE8404UL))
#define bFM4_GPIO_PDOR8_P1                        *((volatile  uint8_t *)(0x42DE8404UL))
#define bFM_GPIO_PDOR8_P2                         *((volatile  uint8_t *)(0x42DE8408UL))
#define bFM4_GPIO_PDOR8_P2                        *((volatile  uint8_t *)(0x42DE8408UL))
#define bFM_GPIO_PDOR8_P3                         *((volatile  uint8_t *)(0x42DE840CUL))
#define bFM4_GPIO_PDOR8_P3                        *((volatile  uint8_t *)(0x42DE840CUL))

