MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2GK8JHAGV20000/mcu.h
#define bFM_SDIF_SPRVAL6_CGSELVAL                 *((volatile  uint8_t *)(0x42DC0DA8UL))
#define bFM4_SDIF_SPRVAL6_CGSELVAL                *((volatile  uint8_t *)(0x42DC0DA8UL))

#define bFM_SDIF_SPRVAL7_CGSELVAL                 *((volatile  uint8_t *)(0x42DC0DE8UL))
#define bFM4_SDIF_SPRVAL7_CGSELVAL                *((volatile  uint8_t *)(0x42DC0DE8UL))

#define bFM_SDIF_SPWRCTL_SDBUSPWR                 *((volatile  uint8_t *)(0x42DC0520UL))
#define bFM4_SDIF_SPWRCTL_SDBUSPWR                *((volatile  uint8_t *)(0x42DC0520UL))

#define bFM_SDIF_SPWSWCL_ATPWRSWEN                *((volatile  uint8_t *)(0x42DC2080UL))
#define bFM4_SDIF_SPWSWCL_ATPWRSWEN               *((volatile  uint8_t *)(0x42DC2080UL))
#define bFM_SDIF_SPWSWCL_IOREGSEL                 *((volatile  uint8_t *)(0x42DC2084UL))
#define bFM4_SDIF_SPWSWCL_IOREGSEL                *((volatile  uint8_t *)(0x42DC2084UL))

#define bFM_SDIF_SSRST_SWRSTALL                   *((volatile  uint8_t *)(0x42DC05E0UL))
#define bFM4_SDIF_SSRST_SWRSTALL                  *((volatile  uint8_t *)(0x42DC05E0UL))
#define bFM_SDIF_SSRST_SWRSTCMDLN                 *((volatile  uint8_t *)(0x42DC05E4UL))
#define bFM4_SDIF_SSRST_SWRSTCMDLN                *((volatile  uint8_t *)(0x42DC05E4UL))
#define bFM_SDIF_SSRST_SWRSTDATLN                 *((volatile  uint8_t *)(0x42DC05E8UL))
#define bFM4_SDIF_SSRST_SWRSTDATLN                *((volatile  uint8_t *)(0x42DC05E8UL))

#define bFM_SDIF_STRSFMD_DMAEN                    *((volatile  uint8_t *)(0x42DC0180UL))
#define bFM4_SDIF_STRSFMD_DMAEN                   *((volatile  uint8_t *)(0x42DC0180UL))
#define bFM_SDIF_STRSFMD_BLCKCNTEN                *((volatile  uint8_t *)(0x42DC0184UL))
#define bFM4_SDIF_STRSFMD_BLCKCNTEN               *((volatile  uint8_t *)(0x42DC0184UL))
#define bFM_SDIF_STRSFMD_DTTRSFDIR                *((volatile  uint8_t *)(0x42DC0190UL))
#define bFM4_SDIF_STRSFMD_DTTRSFDIR               *((volatile  uint8_t *)(0x42DC0190UL))
#define bFM_SDIF_STRSFMD_BLCKCNTSEL               *((volatile  uint8_t *)(0x42DC0194UL))
#define bFM4_SDIF_STRSFMD_BLCKCNTSEL              *((volatile  uint8_t *)(0x42DC0194UL))

#define bFM_SDIF_STUNSETH_CMDCFCHKDS              *((volatile  uint8_t *)(0x42DC2140UL))
#define bFM4_SDIF_STUNSETH_CMDCFCHKDS             *((volatile  uint8_t *)(0x42DC2140UL))

#define bFM_SDIF_STUNSETL_TNPHSELEN               *((volatile  uint8_t *)(0x42DC2120UL))
#define bFM4_SDIF_STUNSETL_TNPHSELEN              *((volatile  uint8_t *)(0x42DC2120UL))
#define bFM_SDIF_STUNSETL_TNERRBDSEL              *((volatile  uint8_t *)(0x42DC2124UL))
#define bFM4_SDIF_STUNSETL_TNERRBDSEL             *((volatile  uint8_t *)(0x42DC2124UL))
#define bFM_SDIF_STUNSETL_RETNTAPSEL              *((volatile  uint8_t *)(0x42DC2128UL))
#define bFM4_SDIF_STUNSETL_RETNTAPSEL             *((volatile  uint8_t *)(0x42DC2128UL))

#define bFM_SDIF_SWKUPCTL_WKUPEVNTEN0             *((volatile  uint8_t *)(0x42DC0560UL))
#define bFM4_SDIF_SWKUPCTL_WKUPEVNTEN0            *((volatile  uint8_t *)(0x42DC0560UL))
#define bFM_SDIF_SWKUPCTL_WKUPEVNTEN1             *((volatile  uint8_t *)(0x42DC0564UL))
#define bFM4_SDIF_SWKUPCTL_WKUPEVNTEN1            *((volatile  uint8_t *)(0x42DC0564UL))
#define bFM_SDIF_SWKUPCTL_WKUPEVNTEN2             *((volatile  uint8_t *)(0x42DC0568UL))
#define bFM4_SDIF_SWKUPCTL_WKUPEVNTEN2            *((volatile  uint8_t *)(0x42DC0568UL))


/******************************************************************************
 ** SMCIF Registers SMCIF0
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_SMCIF0_BAUDRATE_LITTLESTEP            *((volatile  uint16_t*)(0x427922BCUL))
#define bFM4_SMCIF0_BAUDRATE_LITTLESTEP           *((volatile  uint16_t*)(0x427922BCUL))

#define bFM_SMCIF0_FIFO_CLEAR_MSB_READ_CLRRDFIFO  *((volatile  uint16_t*)(0x42792700UL))
#define bFM4_SMCIF0_FIFO_CLEAR_MSB_READ_CLRRDFIFO *((volatile  uint16_t*)(0x42792700UL))

#define bFM_SMCIF0_FIFO_CLEAR_MSB_WRITE_CLRWRFIFO *((volatile  uint16_t*)(0x42792680UL))
#define bFM4_SMCIF0_FIFO_CLEAR_MSB_WRITE_CLRWRFIFO *((volatile  uint16_t*)(0x42792680UL))

#define bFM_SMCIF0_FIFO_MODE_FIFOEN               *((volatile  uint16_t*)(0x42792600UL))
#define bFM4_SMCIF0_FIFO_MODE_FIFOEN              *((volatile  uint16_t*)(0x42792600UL))
#define bFM_SMCIF0_FIFO_MODE_RDFIFOOVRIRQEN       *((volatile  uint16_t*)(0x42792604UL))
#define bFM4_SMCIF0_FIFO_MODE_RDFIFOOVRIRQEN      *((volatile  uint16_t*)(0x42792604UL))
#define bFM_SMCIF0_FIFO_MODE_WRFIFOIRQEN          *((volatile  uint16_t*)(0x42792608UL))
#define bFM4_SMCIF0_FIFO_MODE_WRFIFOIRQEN         *((volatile  uint16_t*)(0x42792608UL))
#define bFM_SMCIF0_FIFO_MODE_RDFIFOIRQEN          *((volatile  uint16_t*)(0x4279260CUL))
#define bFM4_SMCIF0_FIFO_MODE_RDFIFOIRQEN         *((volatile  uint16_t*)(0x4279260CUL))

#define bFM_SMCIF0_GLOBALCONTROL1_PARITY          *((volatile  uint16_t*)(0x42792000UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_PARITY         *((volatile  uint16_t*)(0x42792000UL))
#define bFM_SMCIF0_GLOBALCONTROL1_FRM0            *((volatile  uint16_t*)(0x42792004UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_FRM0           *((volatile  uint16_t*)(0x42792004UL))
#define bFM_SMCIF0_GLOBALCONTROL1_FRM1            *((volatile  uint16_t*)(0x42792008UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_FRM1           *((volatile  uint16_t*)(0x42792008UL))
#define bFM_SMCIF0_GLOBALCONTROL1_MODE8N1         *((volatile  uint16_t*)(0x4279200CUL))
#define bFM4_SMCIF0_GLOBALCONTROL1_MODE8N1        *((volatile  uint16_t*)(0x4279200CUL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKRXFUL       *((volatile  uint16_t*)(0x42792010UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_MASKRXFUL      *((volatile  uint16_t*)(0x42792010UL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKTXEMP       *((volatile  uint16_t*)(0x42792014UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_MASKTXEMP      *((volatile  uint16_t*)(0x42792014UL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKSTI         *((volatile  uint16_t*)(0x42792018UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_MASKSTI        *((volatile  uint16_t*)(0x42792018UL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKCAEVENT     *((volatile  uint16_t*)(0x4279201CUL))
#define bFM4_SMCIF0_GLOBALCONTROL1_MASKCAEVENT    *((volatile  uint16_t*)(0x4279201CUL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKITEXP       *((volatile  uint16_t*)(0x42792020UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_MASKITEXP      *((volatile  uint16_t*)(0x42792020UL))
#define bFM_SMCIF0_GLOBALCONTROL1_IOMOD           *((volatile  uint16_t*)(0x42792024UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_IOMOD          *((volatile  uint16_t*)(0x42792024UL))
#define bFM_SMCIF0_GLOBALCONTROL1_CKMOD           *((volatile  uint16_t*)(0x42792028UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_CKMOD          *((volatile  uint16_t*)(0x42792028UL))
#define bFM_SMCIF0_GLOBALCONTROL1_RESND           *((volatile  uint16_t*)(0x4279202CUL))
#define bFM4_SMCIF0_GLOBALCONTROL1_RESND          *((volatile  uint16_t*)(0x4279202CUL))
#define bFM_SMCIF0_GLOBALCONTROL1_GUAEN           *((volatile  uint16_t*)(0x42792030UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_GUAEN          *((volatile  uint16_t*)(0x42792030UL))
#define bFM_SMCIF0_GLOBALCONTROL1_STIDT           *((volatile  uint16_t*)(0x42792034UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_STIDT          *((volatile  uint16_t*)(0x42792034UL))
#define bFM_SMCIF0_GLOBALCONTROL1_IDTSC           *((volatile  uint16_t*)(0x42792038UL))
#define bFM4_SMCIF0_GLOBALCONTROL1_IDTSC          *((volatile  uint16_t*)(0x42792038UL))

#define bFM_SMCIF0_GLOBALCONTROL2_RX8N1           *((volatile  uint16_t*)(0x42792400UL))
#define bFM4_SMCIF0_GLOBALCONTROL2_RX8N1          *((volatile  uint16_t*)(0x42792400UL))
#define bFM_SMCIF0_GLOBALCONTROL2_INVDATAOUT      *((volatile  uint16_t*)(0x42792404UL))
#define bFM4_SMCIF0_GLOBALCONTROL2_INVDATAOUT     *((volatile  uint16_t*)(0x42792404UL))
#define bFM_SMCIF0_GLOBALCONTROL2_ICCDISABLE      *((volatile  uint16_t*)(0x4279240CUL))
#define bFM4_SMCIF0_GLOBALCONTROL2_ICCDISABLE     *((volatile  uint16_t*)(0x4279240CUL))

